In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'col1' : [1,2,3,4], 'col2' : [444,555,666,444], 'col3' : ['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique()

array([444, 555, 666])

In [5]:
df['col2'].nunique() # number of unique value

3

In [6]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [7]:
newdf = df[ (df['col1'] > 2) & (df['col2'] == 444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [8]:
def times_two(number):
    return number *2

In [9]:
times_two(4)

8

In [10]:
df.apply(times_two)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [11]:
df['new'] = df['col1'].apply(times_two)
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [12]:
df.drop('new', inplace = True, axis = 1)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [15]:
df.sort_values('col1', ascending=False)

   col1  col2 col3
3     4   444  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc